{
	"achievements": [
		{
			"title": "Created my very first website 👨‍💻",
			"date": "2002",
			"description": "I'm not sure when exactly I used HTML to create a website and make it accessible to the world. I know I used Geocities to host it. What a time."
		},
		{
			"title": "Learned the electric guitar 🎸",
			"date": "2004",
			"description": "Playing guitar is one of maybe 3 hobbies that stayed with me since I started it. I love rock and metal and being able to play some of my favorite songs is a lot of fun."
		},
		{
			"title": "Became a dad 🐣",
			"date": "2014",
			"description": "Not that I had that much to do with the process of the creation, but this the one thing I'm most proud of."
		},
		{
			"title": "Learned Vue.js 👨‍💻",
			"date": "March 2016",
			"description": "When I started my new job at cäsar gustav, I was introduced to Vue.js. I was so excited to learn it and I build things that would actually ship."
		},
		{
			"title": "Implemented a SAP-to-Shopware-API 👨‍💻",
			"date": "October 2019",
			"description": "Using Shopware 6 I realized a REST API which communicated orders to a SAP instance. It also could receive things like stock and product information to update the product catalog."
		},
		{
			"title": "Got promoted to CTO",
			"date": "August 2020",
			"description": "Chris was kind enough to put so much trust in me that he gave me the position of CTO. I was able to take on a lot of responsibility and I'm proud of it."
		},
		{
			"title": "Rewrote a Vue.js website to AlpineJS 👨‍💻",
			"date": "May 2021",
			"description": "I replaced Vue.js with AlpineJS for one of our ecommerce clients and realized nearly double the old performance score. I wrote about it <a href=\"/articles/from-vue-to-alpinejs/\">here</a>."
		},
		{
			"title": "Learned Eleventy 👨‍💻",
			"date": "August 2021",
			"description": "In summer 2021 I wanted to rewrite my website and was searching for a new tech stack. I found Eleventy and realized <a href=\"/articles/eleventyjs-is-great/\">it was a good fit</a>."
		},
		{
			"title": "Learned the 7-string guitar 🎸",
			"date": "October 2021",
			"description": "Although 'learned' is a strong word, but after buying my first 7-string I finally found the time to really play with it and get better at it."
		},
		{
			"title": "Deployed my first serverless function 👨‍💻",
			"date": "February 2022",
			"description": "Using Cloudflare Workers I deployed two functions to show my last tweet and scrobble on my homepage."
		},
		{
			"title": "Reached > 600 clicks in a month through search engines",
			"date": "May 2022",
			"description": "I've connected my site to Googles Search Console to get more insight how my content is found. In May I received a notification that I've accumulated over 600 clicks through Google alone 😱. When starting to write articles I would have never thought to reach so many people in such short time."
		},
		{
			"title": "Creating a Web-based Times Table Tool for My Child",
			"date": "June 2022",
			"description": "Traditional paper-based multiplication tables can be dull and monotonous. So, I developed a program to make learning multiplication engaging for my child.<br>Feel free to try it <a href=\"/einmaleins\">here</a>."
		},
		{
			"title": "Reached > 3000 clicks in a month through search engines",
			"date": "December 2022",
			"description": "In December I received another notification that I've now reached 3.000 clicks. 5 times more than roughly a half year earlier. I'm really happy that my articles are found by so many people. 🤗"
		}
	]
}
